Revit 2026 API

# IFCParameterTemplateSetActiveTemplate Method

---

Sets the mapping template element to be the active mapping template for its document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetActiveTemplate()
```
```vb
Public Sub SetActiveTemplate
```
```cpp
public:
void SetActiveTemplate()
```
```fsharp
member SetActiveTemplate : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Invalid use of in-session template. |

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace